Repository: kibis-is/mobile-app
Catalog: lib/l10n/intl_*.arb
Languages: es, th, tr, vi

# insufficientFundsError
source: Insufficient funds.
es: Fondos insuficientes.
th: ยอดเงินคงเหลือไม่เพียงพอ
tr: Yetersiz bakiye.
vi: Số dư không đủ.

# transactionFailedToConfirm
source: Transaction failed to confirm within the expected rounds.
es: La transacción no se confirmó dentro de las rondas esperadas.
th: ธุรกรรมไม่สามารถยืนยันได้ภายในรอบที่คาดไว้
tr: İşlem beklenen turlar içinde onaylanamadı.
vi: Giao dịch không thể xác nhận trong các vòng dự kiến.

source: Sending Payment
es: Enviando Pago
th: กำลังส่งการชำระเงิน
tr: Ödeme Gönderiliyor
vi: Đang gửi thanh toán

source: Sending Asset
es: Enviando Activo
th: กำลังส่งสินทรัพย์
tr: Varlık Gönderiliyor
vi: Đang gửi tài sản

source: Contact name updated successfully.
es: Nombre del contacto actualizado con éxito.
th: อัปเดตชื่อผู้ติดต่อสำเร็จ
tr: Kişi adı başarıyla güncellendi.
vi: Tên liên hệ đã được cập nhật thành công.

source: Contact saved successfully.
es: Contacto guardado con éxito.
th: บันทึกผู้ติดต่อสำเร็จ
tr: Kişi başarıyla kaydedildi.
vi: Liên hệ đã được lưu thành công.

# failedToSaveContact
source: Failed to save contact: {error}
es: Error al guardar el contacto: {error}
th: ไม่สามารถบันทึกผู้ติดต่อ: {error}
tr: Kişi kaydedilemedi: {error}
vi: Không thể lưu liên hệ: {error}

source: Max
es: Máximo
th: สูงสุด
tr: Maks
vi: Tối đa

source: Error
th: ข้อผิดพลาด
tr: Hata
vi: Lỗi

source: Calculating...
es: Calculando...
th: กำลังคำนวณ
tr: Hesaplanıyor...
vi: Đang tính toán...

# maxVoiAmountCalculation
source: The maximum VOI amount is calculated by: the balance ({balance}), minus the minimum balance needed to keep the account open ({minimumBalance}), minus the minimum transaction fee (0.001)
es: La cantidad máxima de VOI se calcula como: el saldo ({balance}), menos el saldo mínimo necesario para mantener la cuenta abierta ({minimumBalance}), menos la tarifa mínima de transacción (0.001)
th: จำนวน VOI สูงสุดคำนวณโดย: ยอดคงเหลือ ({balance}) ลบด้วยยอดคงเหลือขั้นต่ำ ({minimumBalance}) และค่าธรรมเนียมธุรกรรมขั้นต่ำ (0001)
tr: Maksimum VOI miktarı şöyle hesaplanır: bakiye ({balance}), eksi hesabı açık tutmak için gerekli minimum bakiye ({minimumBalance}), eksi minimum işlem ücreti (0.001)
vi: Số tiền VOI tối đa được tính bằng: số dư ({balance}), trừ số dư tối thiểu cần thiết để giữ tài khoản hoạt động ({minimumBalance}), trừ phí giao dịch tối thiểu (0.001)

source: Info
es: Información
th: ข้อมูล
tr: Bilgi
vi: Thông tin

source: Account
es: Cuenta
th: บัญชี
tr: Hesap
vi: Tài khoản

source: Asset
es: Activo
th: สินทรัพย์
tr: Varlık
vi: Tài sản

source: Amount
es: Monto
th: จำนวนเงิน
tr: Miktar
vi: Số tiền

source: Contact Name (Optional)
es: Nombre del Contacto (Opcional)
th: ชื่อผู้ติดต่อ (ไม่บังคับ)
tr: Kişi Adı (İsteğe Bağlı)
vi: Tên liên hệ (Tùy chọn)

source: Note (Optional)
es: Nota (Opcional)
th: หมายเหตุ (ไม่บังคับ)
tr: Not (İsteğe Bağlı)
vi: Ghi chú (Tùy chọn)

source: Send
es: Enviar
th: ส่ง
tr: Gönder
vi: Gửi

source: Select Asset
es: Seleccionar Activo
th: เลือกสินทรัพย์
tr: Varlık Seçin
vi: Chọn tài sản

source: Transaction failed
es: Transacción fallida
th: การทำธุรกรรมล้มเหลว
tr: İşlem başarısız oldu
vi: Giao dịch thất bại

source: No account
es: Sin cuenta
th: ไม่มีบัญชี
tr: Hesap yok
vi: Không có tài khoản

# noteTooLarge
source: Note is too large.
es: La nota es demasiado grande.
th: หมายเหตุมีขนาดใหญ่เกินไป
tr: Not çok büyük.
vi: Ghi chú quá lớn.

# sendTransactionTitle
source: Send Transaction
es: Enviar Transacción
th: ส่งธุรกรรม
tr: İşlem Gönder
vi: Gửi giao dịch

source: Loading...
es: Cargando...
th: กำลังโหลด
tr: Yükleniyor...
vi: Đang tải...

source: Failed to load
es: No se pudo cargar
th: ไม่สามารถโหลดได้
tr: Yüklenemedi
vi: Không thể tải

source: Recipient Address
es: Dirección del Destinatario
th: ที่อยู่ผู้รับ
tr: Alıcı Adresi
vi: Địa chỉ người nhận

source: No Items
es: Sin elementos
th: ไม่มีรายการ
tr: Öğe yok
vi: Không có mục nào

source: About
es: Acerca de
th: เกี่ยวกับ
tr: Hakkında
vi: Giới thiệu

source: Version:
es: Versión:
th: เวอร์ชัน:
tr: Sürüm:
vi: Phiên bản:

source: Build:
es: Compilación:
th: บิลด์:
tr: Yapı:
vi: Bản dựng:

source: Build Number:
es: Número de Compilación:
th: หมายเลขบิลด์:
tr: Yapı Numarası:
vi: Số bản dựng:

source: Advanced
es: Avanzado
th: ขั้นสูง
tr: Gelişmiş
vi: Nâng cao

# networkSwitched
source: Network switched to {networkName}
es: Red cambiada a {networkName}
th: เปลี่ยนเครือข่ายเป็น {networkName}
tr: Ağ {networkName} olarak değiştirildi
vi: Mạng đã được chuyển sang {networkName}

source: Allow Test Networks
es: Permitir Redes de Prueba
th: อนุญาตเครือข่ายทดสอบ
tr: Test Ağlarına İzin Ver
vi: Cho phép mạng thử nghiệm

# toggleTestNetworksDescription
source: Toggle to include test networks in the network list.
es: Activar para incluir redes de prueba en la lista de redes.
th: สลับเพื่อรวมเครือข่ายทดสอบในรายการเครือข่าย
tr: Ağ listesine test ağlarını dahil etmek için geçiş yapın.
vi: Chuyển đổi để bao gồm mạng thử nghiệm trong danh sách mạng.

source: Appearance
es: Apariencia
th: ลักษณะ
tr: Görünüm
vi: Giao diện

source: Dark Mode
es: Modo Oscuro
th: โหมดมืด
tr: Karanlık Mod
vi: Chế độ tối

source: General
th: ทั่วไป
tr: Genel
vi: Chung

source: Danger Zone
es: Zona de Peligro
th: เขตอันตราย
tr: Tehlikeli Bölge
vi: Vùng nguy hiểm

# dangerZoneDescription
source: This will remove all accounts, settings, and security information.
es: Esto eliminará todas las cuentas, configuraciones e información de seguridad.
th: นี่จะลบบัญชีทั้งหมด การตั้งค่า และข้อมูลความปลอดภัย
tr: Bu, tüm hesapları, ayarları ve güvenlik bilgilerini kaldıracaktır.
vi: Điều này sẽ xóa tất cả tài khoản, cài đặt và thông tin bảo mật.

source: Confirm Reset
es: Confirmar Restablecimiento
th: ยืนยันการรีเซ็ต
tr: Sıfırlamayı Onayla
vi: Xác nhận đặt lại

source: Export Accounts
es: Exportar Cuentas
th: ส่งออกบัญชี
tr: Hesapları Dışa Aktar
vi: Xuất tài khoản

# noAccountsForExport
source: No accounts available for export.
es: No hay cuentas disponibles para exportar.
th: ไม่มีบัญชีที่พร้อมสำหรับการส่งออก
tr: Dışa aktarmak için uygun hesap yok.
vi: Không có tài khoản nào khả dụng để xuất.

source: Unnamed Account
es: Cuenta Sin Nombre
th: บัญชีไม่มีชื่อ
tr: Adlandırılmamış Hesap
vi: Tài khoản chưa đặt tên

# accountCannotBeExported
source: This account cannot be exported, as it has no private key.
es: Esta cuenta no se puede exportar, ya que no tiene una clave privada.
th: ไม่สามารถส่งออกบัญชีนี้ได้เนื่องจากไม่มีคีย์ส่วนตัว
tr: Bu hesap özel anahtarı olmadığı için dışa aktarılamaz.
vi: Tài khoản này không thể xuất được vì không có khóa riêng tư.

source: All Accounts
es: Todas las Cuentas
th: บัญชีทั้งหมด
tr: Tüm Hesaplar
vi: Tất cả tài khoản

source: Security
es: Seguridad
th: ความปลอดภัย
tr: Güvenlik
vi: Bảo mật

source: Enable Password Lock
es: Activar Bloqueo con Contraseña
th: เปิดใช้งานล็อกรหัสผ่าน
tr: Şifre Kilidini Etkinleştir
vi: Bật khóa bằng mật khẩu

source: Select Timeout
es: Seleccionar Tiempo de Espera
th: เลือกช่วงหมดเวลา
tr: Zaman Aşımı Seçin
vi: Chọn thời gian chờ

source: Timeout
es: Tiempo de Espera
th: ช่วงหมดเวลา
tr: Zaman Aşımı
vi: Thời gian chờ

source: Change Pin
es: Cambiar PIN
th: เปลี่ยน PIN
tr: Pin Değiştir
vi: Đổi mã PIN

source: Sessions
es: Sesiones
th: เซสชัน
tr: Oturumlar
vi: Phiên

source: Disconnect All Sessions?
es: ¿Desconectar Todas las Sesiones?
th: ตัดการเชื่อมต่อเซสชันทั้งหมด
tr: Tüm Oturumları Sonlandır?
vi: Ngắt kết nối tất cả các phiên?

# disconnectAllSessionsPrompt
source: Disconnect all sessions?
es: ¿Desconectar todas las sesiones?
th: ต้องการตัดการเชื่อมต่อเซสชันทั้งหมดหรือไม่
tr: Tüm oturumları sonlandırmak istiyor musunuz?
vi: Ngắt kết nối tất cả các phiên?

source: No active sessions.
es: No hay sesiones activas.
th: ไม่มีเซสชันที่ใช้งาน
tr: Aktif oturum yok.
vi: Không có phiên nào đang hoạt động.

# disconnectAllSessionsForAccountPrompt
source: Disconnect all sessions for this account?
es: ¿Desconectar todas las sesiones para esta cuenta?
th: ต้องการตัดการเชื่อมต่อเซสชันทั้งหมดสำหรับบัญชีนี้หรือไม่
tr: Bu hesap için tüm oturumları sonlandırmak istiyor musunuz?
vi: Ngắt kết nối tất cả các phiên cho tài khoản này?

source: Disconnect All
es: Desconectar Todo
th: ตัดการเชื่อมต่อทั้งหมด
tr: Tümünü Sonlandır
vi: Ngắt kết nối tất cả

source: Expires:
es: Expira:
th: หมดอายุ:
tr: Son Kullanma Tarihi:
vi: Hết hạn:

# failedToDisconnect
source: Failed to disconnect {sessionName}. Please try again.
es: No se pudo desconectar {sessionName}. Por favor, inténtalo de nuevo.
th: ไม่สามารถตัดการเชื่อมต่อ {sessionName} โปรดลองอีกครั้ง
tr: {sessionName} oturumu sonlandırılamadı. Lütfen tekrar deneyin.
vi: Không thể ngắt kết nối {sessionName}. Vui lòng thử lại.

# sessionDisconnected
source: {sessionName} disconnected successfully.
es: {sessionName} desconectada con éxito.
th: {sessionName} ตัดการเชื่อมต่อสำเร็จ
tr: {sessionName} oturumu başarıyla sonlandırıldı.
vi: {sessionName} đã ngắt kết nối thành công.

source: All sessions
es: Todas las sesiones
th: เซสชันทั้งหมด
tr: Tüm oturumlar
vi: Tất cả các phiên

# allSessionsFor
source: All sessions for {publicKey}
es: Todas las sesiones para {publicKey}
th: เซสชันทั้งหมดสำหรับ {publicKey}
tr: {publicKey} için tüm oturumlar
vi: Tất cả các phiên cho {publicKey}

source: Disconnect
es: Desconectar
th: ตัดการเชื่อมต่อ
tr: Bağlantıyı Kes
vi: Ngắt kết nối

source: Settings
es: Configuración
th: การตั้งค่า
tr: Ayarlar
vi: Cài đặt

source: Create New Account
es: Crear Nueva Cuenta
th: สร้างบัญชีใหม่
tr: Yeni Hesap Oluştur
vi: Tạo tài khoản mới

# createNewAccountSubtitle
source: You will be prompted to save a seed.
es: Se te pedirá que guardes una frase semilla.
th: คุณจะได้รับการแจ้งให้บันทึก seed
tr: Bir anahtar kelime yedekleme isteği alacaksınız.
vi: Bạn sẽ được nhắc lưu lại cụm từ khóa.

source: Import Via Seed
es: Importar con Frase Semilla
th: นำเข้าผ่าน Seed
tr: Seed ile İçe Aktar
vi: Nhập qua cụm từ khóa

# importViaSeedSubtitle
source: Import an existing account via seed phrase.
es: Importa una cuenta existente con una frase semilla.
th: นำเข้าบัญชีที่มีอยู่ผ่าน seed phrase
tr: Mevcut bir hesabı seed ifadeyle içe aktarın.
vi: Nhập tài khoản hiện có qua cụm từ khóa.

source: Import Via QR Code
es: Importar con Código QR
th: นำเข้าผ่าน QR Code
tr: QR Kod ile İçe Aktar
vi: Nhập qua mã QR

# importViaQrCodeSubtitle
source: Scan a QR code to import an existing account.
es: Escanea un código QR para importar una cuenta existente.
th: สแกน QR code เพื่อนำเข้าบัญชีที่มีอยู่
tr: Mevcut bir hesabı QR kod tarayarak içe aktarın.
vi: Quét mã QR để nhập tài khoản hiện có.

source: Import via Private Key
es: Importar con Clave Privada
th: นำเข้าผ่านคีย์ส่วนตัว
tr: Özel Anahtar ile İçe Aktar
vi: Nhập qua khóa riêng tư

# importViaPrivateKeySubtitle
source: Import accounts from a private key.
es: Importa cuentas con una clave privada.
th: นำเข้าบัญชีผ่านคีย์ส่วนตัว
tr: Özel anahtarla bir hesap içe aktarın.
vi: Nhập tài khoản từ khóa riêng tư.

source: Add Watch
es: Añadir Cuenta de Observación
th: เพิ่ม Watch
tr: Gözlem Hesabı Ekle
vi: Thêm tài khoản giám sát

# addWatchSubtitle
source: Add watch account to watch via public address.
es: Añade una cuenta de observación para monitorear mediante dirección pública.
th: เพิ่มบัญชี Watch เพื่อดูผ่านที่อยู่สาธารณะ
tr: Genel adresle gözlem hesabı ekleyin.
vi: Thêm tài khoản giám sát để xem qua địa chỉ công khai.

# addAccountTitle
source: Add Account
es: Añadir Cuenta
th: เพิ่มบัญชี
tr: Hesap Ekle
vi: Thêm tài khoản

source: Import Public Address
es: Importar Dirección Pública
th: นำเข้าที่อยู่สาธารณะ
tr: Genel Adres İçe Aktar
vi: Nhập địa chỉ công khai

source: Public Address
es: Dirección Pública
th: ที่อยู่สาธารณะ
tr: Genel Adres
vi: Địa chỉ công khai

source: Import
es: Importar
th: นำเข้า
tr: İçe Aktar
vi: Nhập

# pleaseEnterPublicAddress
source: Please enter a public address.
es: Por favor, introduce una dirección pública.
th: กรุณาป้อนที่อยู่สาธารณะ
tr: Lütfen bir genel adres girin.
vi: Vui lòng nhập địa chỉ công khai.

source: Invalid Algorand address.
es: Dirección de Algorand inválida.
th: ที่อยู่ Algorand ไม่ถูกต้อง
tr: Geçersiz Algorand adresi.
vi: Địa chỉ Algorand không hợp lệ.

source: Copy Seed
es: Copiar Frase Semilla
th: คัดลอก Seed
tr: Seed Kopyala
vi: Sao chép cụm từ khóa

source: Generate seed phrase
es: Generar frase semilla
th: สร้าง Seed phrase
tr: Seed ifadesi oluştur
vi: Tạo cụm từ khóa

# seedPhraseDescription
source: Here is your 25 word mnemonic seed phrase. Make sure you save this in a secure place.
es: Aquí está tu frase semilla de 25 palabras. Asegúrate de guardarla en un lugar seguro.
th: นี่คือคำ seed mnemonic 25 คำของคุณ อย่าลืมบันทึกในที่ปลอดภัย
tr: İşte 25 kelimelik seed ifadeniz. Bunu güvenli bir yerde sakladığınızdan emin olun.
vi: Đây là cụm từ khóa gồm 25 từ của bạn. Hãy chắc chắn lưu lại nó ở nơi an toàn.

source: Copy seed phrase
es: Copiar frase semilla
th: คัดลอก seed phrase
tr: Seed ifadesini kopyala
vi: Sao chép cụm từ khóa

source: No seed phrase available.
es: No hay frase semilla disponible.
th: ไม่มี seed phrase ที่พร้อมใช้งาน
tr: Seed ifadesi mevcut değil.
vi: Không có cụm từ khóa khả dụng.

# backupConfirmationRequired
source: You must confirm you have made a backup of your seed phrase.
es: Debes confirmar que has hecho una copia de seguridad de tu frase semilla.
th: คุณต้องยืนยันว่าคุณได้ทำการสำรองข้อมูล seed phrase ของคุณ
tr: Seed ifadenizin bir yedeğini aldığınızı onaylamanız gerekiyor.
vi: Bạn phải xác nhận rằng bạn đã sao lưu cụm từ khóa của mình.

# backupConfirmationPrompt
source: Please confirm you have stored a backup of your seed phrase in a secure location.
es: Por favor, confirma que has guardado una copia de seguridad de tu frase semilla en un lugar seguro.
th: โปรดยืนยันว่าคุณได้บันทึกสำรองข้อมูล seed phrase ของคุณในที่ปลอดภัย
tr: Seed ifadenizin bir yedeğini güvenli bir yerde sakladığınızı onaylayın.
vi: Vui lòng xác nhận rằng bạn đã lưu trữ sao lưu cụm từ khóa của mình ở nơi an toàn.

source: Next
es: Siguiente
th: ถัดไป
tr: İleri
vi: Tiếp theo

source: Import Private Key
es: Importar Clave Privada
th: นำเข้าคีย์ส่วนตัว
tr: Özel Anahtar İçe Aktar
vi: Nhập khóa riêng tư

source: Private Key
es: Clave Privada
th: คีย์ส่วนตัว
tr: Özel Anahtar
vi: Khóa riêng tư

source: Import Seed
es: Importar Frase Semilla
th: นำเข้า Seed
tr: Seed İçe Aktar
vi: Nhập cụm từ khóa

# enterSeedPhrasePrompt
source: Enter your seed phrase to import your account.
es: Introduce tu frase semilla para importar tu cuenta.
th: ป้อน Seed phrase ของคุณเพื่อนำเข้าบัญชี
tr: Hesabınızı içe aktarmak için seed ifadenizi girin.
vi: Nhập cụm từ khóa của bạn để nhập tài khoản.

# enterWord
source: Enter word {index}
es: Introduce la palabra {index}
th: ป้อนคำที่ {index}
tr: Kelimeyi girin {index}
vi: Nhập từ {index}

source: Name Account
es: Nombrar Cuenta
th: ตั้งชื่อบัญชี
tr: Hesap Adlandır
vi: Đặt tên tài khoản

source: Delete
es: Eliminar
th: ลบ
tr: Sil
vi: Xóa

# confirmDeleteAccount
source: Are you sure you want to delete this account?
es: ¿Estás seguro de que deseas eliminar esta cuenta?
th: คุณแน่ใจหรือไม่ว่าต้องการลบบัญชีนี้
tr: Bu hesabı silmek istediğinize emin misiniz?
vi: Bạn có chắc chắn muốn xóa tài khoản này không?

# editAccountNamePrompt
source: Edit your account name
es: Edita el nombre de tu cuenta
th: แก้ไขชื่อบัญชีของคุณ
tr: Hesap adınızı düzenleyin
vi: Chỉnh sửa tên tài khoản của bạn

# nameAccountPrompt
source: Name your account
es: Nombra tu cuenta
th: ตั้งชื่อบัญชีของคุณ
tr: Hesabınızı adlandırın
vi: Đặt tên cho tài khoản của bạn

# editAccountDescription
source: You can change your account name below.
es: Puedes cambiar el nombre de tu cuenta a continuación.
th: คุณสามารถเปลี่ยนชื่อบัญชีของคุณด้านล่าง
tr: Aşağıdan hesap adınızı değiştirebilirsiniz.
vi: Bạn có thể thay đổi tên tài khoản của mình bên dưới.

# nameAccountDescription
source: Give your account a nickname. Don’t worry, you can change this later.
es: Dale un apodo a tu cuenta. No te preocupes, puedes cambiarlo más tarde.
th: ตั้งชื่อเล่นให้บัญชีของคุณ ไม่ต้องกังวล คุณสามารถเปลี่ยนได้ในภายหลัง
tr: Hesabınıza bir takma ad verin. Endişelenmeyin, bunu daha sonra değiştirebilirsiniz.
vi: Đặt biệt danh cho tài khoản của bạn. Đừng lo, bạn có thể thay đổi sau này.

source: Account Name
es: Nombre de la Cuenta
th: ชื่อบัญชี
tr: Hesap Adı
vi: Tên tài khoản

# pleaseEnterText
source: Please enter some text
es: Por favor, introduce texto
th: กรุณาป้อนข้อความ
tr: Lütfen metin girin
vi: Vui lòng nhập một số văn bản

source: Save
es: Guardar
th: บันทึก
tr: Kaydet
vi: Lưu

source: Create
es: Crear
th: สร้าง
tr: Oluştur
vi: Tạo

source: Updating Account
es: Actualizando Cuenta
th: กำลังอัปเดตบัญชี
tr: Hesap Güncelleniyor
vi: Đang cập nhật tài khoản

source: Creating Account
es: Creando Cuenta
th: กำลังสร้างบัญชี
tr: Hesap Oluşturuluyor
vi: Đang tạo tài khoản

# welcomeTitle
source: Welcome
es: Bienvenido
th: ยินดีต้อนรับ
tr: Hoş Geldiniz
vi: Chào mừng

# welcomeMessage
source: Welcome. First, let’s create a new pincode to secure this device.
es: Bienvenido. Primero, vamos a crear un nuevo código PIN para asegurar este dispositivo.
th: ยินดีต้อนรับ ก่อนอื่นเรามาสร้างรหัสพินเพื่อรักษาความปลอดภัยของอุปกรณ์นี้
tr: Hoş geldiniz. Öncelikle, bu cihazı güvenceye almak için yeni bir PIN oluşturun.
vi: Chào mừng bạn. Đầu tiên, hãy tạo một mã PIN để bảo vệ thiết bị này.

source: Algorand Standard Asset
es: Activo Estándar de Algorand
th: สินทรัพย์มาตรฐาน Algorand
tr: Algorand Standart Varlık
vi: Tài sản tiêu chuẩn Algorand

source: Insufficient balance.
es: Saldo insuficiente.
th: ยอดคงเหลือไม่เพียงพอ
tr: Yetersiz bakiye.
vi: Số dư không đủ.

# assetOptInSuccess
source: Asset successfully opted in
es: Activo añadido con éxito
th: ลงทะเบียนสินทรัพย์สำเร็จ
tr: Varlık başarıyla eklenmiştir.
vi: Đăng ký tài sản thành công

source: Application ID
es: ID de Aplicación
th: รหัสแอปพลิเคชัน
tr: Uygulama Kimliği
vi: ID ứng dụng

source: Type
es: Tipo
th: ประเภท
tr: Tür
vi: Loại

source: Decimals
es: Decimales
th: ทศนิยม
tr: Ondalık
vi: Số thập phân

source: Total Supply
es: Suministro Total
th: อุปทานทั้งหมด
tr: Toplam Arz
vi: Tổng cung

source: Send Asset
es: Enviar Activo
th: ส่งสินทรัพย์
tr: Varlık Gönder
vi: Gửi tài sản

source: Add Asset
es: Añadir Activo
th: เพิ่มสินทรัพย์
tr: Varlık Ekle
vi: Thêm tài sản

# optingInMessage
source: Opting in...
es: Añadiendo activo...
th: กำลังลงทะเบียน
tr: Varlık ekleniyor...
vi: Đang đăng ký...

# activeAssetNullError
source: Active asset is null
es: El activo activo es nulo
th: สินทรัพย์ที่ใช้งานเป็นค่าว่าง
tr: Aktif varlık null
vi: Tài sản đang hoạt động là null

# fundAccountError
source: Please fund your account to proceed.
es: Por favor, financia tu cuenta para continuar.
th: โปรดเติมเงินในบัญชีของคุณเพื่อดำเนินการต่อ
tr: Lütfen hesabınıza para yatırın.
vi: Vui lòng nạp tiền vào tài khoản của bạn để tiếp tục.

# privateKeyNotFoundError
source: Private key not found
es: Clave privada no encontrada
th: ไม่พบคีย์ส่วนตัว
tr: Özel anahtar bulunamadı
vi: Không tìm thấy khóa riêng tư

# accountIdOrAddressNotAvailable
source: Account ID or Public Address is not available
es: ID de cuenta o dirección pública no disponible
th: ID บัญชีหรือที่อยู่สาธารณะไม่พร้อมใช้งาน
tr: Hesap Kimliği veya Genel Adres mevcut değil
vi: ID tài khoản hoặc Địa chỉ công khai không khả dụng

# failedToOptInError
source: Failed to opt-in to asset
es: Error al añadir el activo
th: ไม่สามารถลงทะเบียนสินทรัพย์
tr: Varlık eklenemedi
vi: Không thể đăng ký tài sản

# algorandServiceError
source: An error occurred with Algorand service
es: Ocurrió un error con el servicio de Algorand
th: เกิดข้อผิดพลาดกับบริการ Algorand
tr: Algorand servisinde bir hata oluştu
vi: Đã xảy ra lỗi với dịch vụ Algorand

# viewAssetTitle
source: View Asset
es: Ver Activo
th: ดูสินทรัพย์
tr: Varlık Görüntüle
vi: Xem tài sản

# addAssetTitle
source: Add Asset
es: Añadir Activo
th: เพิ่มสินทรัพย์
tr: Varlık Ekle
vi: Thêm tài sản

# noAssetAvailableMessage
source: No asset available to display.
es: No hay activo disponible para mostrar.
th: ไม่มีสินทรัพย์ที่พร้อมแสดง
tr: Görüntülenecek varlık yok.
vi: Không có tài sản nào để hiển thị.

# optOutTooltip
source: Opt-out
es: Optar Salida
th: ยกเลิกการลงทะเบียน
tr: Çıkış Yap
vi: Hủy đăng ký

# optOutAssetTitle
source: Opt Out of Asset?
es: ¿Optar por salir del activo?
th: ยกเลิกการลงทะเบียนสินทรัพย์
tr: Varlıktan Çık?
vi: Hủy đăng ký tài sản?

# optOutAssetContent
source: Are you sure you want to opt out of this ARC-0200 asset?
es: ¿Estás seguro de que deseas optar por salir de este activo ARC-0200?
th: คุณแน่ใจหรือไม่ว่าต้องการยกเลิกการลงทะเบียนสินทรัพย์ ARC-0200 นี้
tr: Bu ARC-0200 varlığından çıkmak istediğinizden emin misiniz?
vi: Bạn có chắc chắn muốn hủy đăng ký tài sản ARC-0200 này không?

# optOutButton
source: Opt Out
es: Optar Salida
th: ยกเลิกการลงทะเบียน
tr: Çıkış Yap
vi: Hủy đăng ký

# cancelButton
source: Cancel
es: Cancelar
th: ยกเลิก
tr: İptal
vi: Hủy

# nftViewerTitle
source: NFT Viewer
es: Visor de NFTs
th: ดู NFT
tr: NFT Görüntüleyici
vi: Trình xem NFT

# sentTransactionTitle
source: Sent Transaction
es: Transacción Enviada
th: ธุรกรรมที่ส่งออก
tr: Gönderilen İşlem
vi: Giao dịch đã gửi

source: Transaction Type
es: Tipo de Transacción
th: ประเภทธุรกรรม
tr: İşlem Türü
vi: Loại giao dịch

# fromField
source: From
es: De
th: จาก
tr: Gönderen
vi: Từ

# toField
source: To
es: Para
th: ถึง
tr: Alıcı
vi: Đến

source: Fee
es: Tarifa
th: ค่าธรรมเนียม
tr: Ücret
vi: Phí

source: Date
es: Fecha
th: วันที่
tr: Tarih
vi: Ngày

source: Transaction ID
es: ID de Transacción
th: รหัสธุรกรรม
tr: İşlem Kimliği
vi: ID giao dịch

source: Note
es: Nota
th: หมายเหตุ
tr: Not
vi: Ghi chú

# receivedTransactionTitle
source: Received Transaction
es: Transacción Recibida
th: ธุรกรรมที่ได้รับ
tr: Alınan İşlem
vi: Giao dịch đã nhận

# selfTransferTitle
source: Self Transfer
es: Transferencia Propia
th: การโอนให้ตัวเอง
tr: Kendi Kendine Transfer
vi: Chuyển khoản cho chính mình

# viewTransactionTitle
source: View Transaction
es: Ver Transacción
th: ดูธุรกรรม
tr: İşlemi Görüntüle
vi: Xem giao dịch

# noTransactionAvailable
source: No transaction available to display.
es: No hay transacción disponible para mostrar.
th: ไม่มีธุรกรรมที่พร้อมแสดง
tr: Görüntülenecek işlem yok.
vi: Không có giao dịch nào để hiển thị.

# invalidAddressSupplied
source: The supplied value "{value}" is not a valid address.
es: El valor proporcionado "{value}" no es una dirección válida.
th: ค่าที่ให้ "{value}" ไม่ใช่ที่อยู่ที่ถูกต้อง
tr: Girilen değer "{value}" geçerli bir adres değil.
vi: Giá trị được cung cấp "{value}" không phải là địa chỉ hợp lệ.

# invalidAddressByteLength
source: Byte string must be {expected} bytes long for a valid address, found "{found}" length.
es: La cadena de bytes debe tener {expected} bytes para una dirección válida, se encontró longitud "{found}".
th: สตริงไบต์ต้องมีความยาว {expected} ไบต์สำหรับที่อยู่ที่ถูกต้อง พบความยาว "{found}"
tr: Bayt dizisi geçerli bir adres için {expected} bayt uzunluğunda olmalıdır, ancak "{found}" uzunluk bulundu.
vi: Chuỗi byte phải dài {expected} byte để trở thành địa chỉ hợp lệ, tìm thấy độ dài "{found}".

# addressType
source: address
es: dirección
th: ที่อยู่
tr: adres
vi: địa chỉ

source: No active account found.
es: No se encontró ninguna cuenta activa.
th: ไม่พบบัญชีที่ใช้งาน
tr: Etkin hesap bulunamadı.
vi: Không tìm thấy tài khoản đang hoạt động.

# failedToInitializeAccount
source: Failed to initialize account: {error}
es: Error al inicializar la cuenta: {error}
th: ไม่สามารถเริ่มต้นบัญชีได้: {error}
tr: Hesap başlatılamadı: {error}
vi: Không thể khởi tạo tài khoản: {error}

source: Public key not found in storage.
es: Clave pública no encontrada en el almacenamiento.
th: ไม่พบคีย์สาธารณะในที่เก็บข้อมูล
tr: Genel anahtar depolamada bulunamadı.
vi: Không tìm thấy khóa công khai trong bộ nhớ.
