Repository: kibis-is/mobile-app
Catalog: lib/l10n/intl_*.arb
Languages: es, th, tr, vi

source: No Internet Connection
es: Sin conexión a Internet
th: ไม่มีการเชื่อมต่ออินเทอร์เน็ต
tr: İnternet Bağlantısı Yok
vi: Không có kết nối Internet

# initializationError
source: Initialization error, please restart the app.
es: Error de inicialización, por favor reinicia la aplicación.
th: เกิดข้อผิดพลาดในการเริ่มต้น กรุณารีสตาร์ทแอป
tr: Başlatma hatası, lütfen uygulamayı yeniden başlatın.
vi: Lỗi khởi tạo, vui lòng khởi động lại ứng dụng.

source: Unknown
es: Desconocido
th: ไม่ทราบ
tr: Bilinmeyen
vi: Không xác định

source: Already added
es: Ya agregado
th: เพิ่มแล้ว
tr: Zaten eklenmiş
vi: Đã thêm

# defaultConfirmationTitle
source: Are you sure?
es: ¿Estás seguro?
th: คุณแน่ใจหรือไม่
tr: Emin misiniz?
vi: Bạn có chắc chắn không?

# defaultConfirmationContent
source: Do you want to proceed with this action?
es: ¿Quieres proceder con esta acción?
th: คุณต้องการดำเนินการนี้ต่อหรือไม่
tr: Bu işlemi yapmak istediğinizden emin misiniz?
vi: Bạn có muốn tiếp tục thực hiện hành động này không?

source: Yes
es: Sí
th: ใช่
tr: Evet
vi: Có

source: No
th: ไม่
tr: Hayır
vi: Không

source: OK
es: Aceptar
th: ตกลง
tr: Tamam

source: Confirm
es: Confirmar
th: ยืนยัน
tr: Onayla
vi: Xác nhận

# pullToRefresh
source: Pull down to refresh
es: Tira hacia abajo para actualizar
th: ดึงลงเพื่อรีเฟรช
tr: Yenilemek için aşağı çekin
vi: Kéo xuống để làm mới

source: Release to refresh
es: Suelta para actualizar
th: ปล่อยเพื่อรีเฟรช
tr: Yenilemek için bırakın
vi: Thả ra để làm mới

source: Refreshing...
es: Actualizando...
th: กำลังรีเฟรช
tr: Yenileniyor...
vi: Đang làm mới...

# initializing
source: Init
es: Iniciando
th: กำลังเริ่มต้น
tr: Başlatılıyor
vi: Khởi tạo

source: Reset
es: Restablecer
th: รีเซ็ต
tr: Sıfırla
vi: Đặt lại

# resetConfirmationMessage
source: Are you sure you want to reset this device? This will remove all accounts, settings, and security information.
es: ¿Estás seguro de que deseas restablecer este dispositivo? Esto eliminará todas las cuentas, configuraciones e información de seguridad.
th: คุณแน่ใจหรือไม่ว่าต้องการรีเซ็ตอุปกรณ์นี้ การดำเนินการนี้จะลบบัญชี การตั้งค่า และข้อมูลความปลอดภัยทั้งหมด
tr: Bu cihazı sıfırlamak istediğinizden emin misiniz? Bu işlem tüm hesapları, ayarları ve güvenlik bilgilerini kaldıracaktır.
vi: Bạn có chắc chắn muốn đặt lại thiết bị này không? Điều này sẽ xóa tất cả tài khoản, cài đặt và thông tin bảo mật.

# pinMismatchError
source: PIN does not match.
es: El PIN no coincide.
th: รหัส PIN ไม่ตรงกัน
tr: PIN eşleşmiyor.
vi: Mã PIN không khớp.

# incorrectPinError
source: Incorrect PIN. Try again.
es: PIN incorrecto. Inténtalo de nuevo.
th: รหัส PIN ไม่ถูกต้อง ลองอีกครั้ง
tr: Yanlış PIN. Tekrar deneyin.
vi: Mã PIN không đúng. Thử lại.

# timeout1Minute
source: 1 minute
es: 1 minuto
th: 1 นาที
tr: 1 dakika
vi: 1 phút

# timeout2Minutes
source: 2 minutes
es: 2 minutos
th: 2 นาที
tr: 2 dakika
vi: 2 phút

# timeout5Minutes
source: 5 minutes
es: 5 minutos
th: 5 นาที
tr: 5 dakika
vi: 5 phút

# timeout10Minutes
source: 10 minutes
es: 10 minutos
th: 10 นาที
tr: 10 dakika
vi: 10 phút

# timeout15Minutes
source: 15 minutes
es: 15 minutos
th: 15 นาที
tr: 15 dakika
vi: 15 phút

# transactionGroupSizeExceeded
source: Transaction group size exceeds the maximum size of "{maxSize}"
es: El tamaño del grupo de transacciones excede el tamaño máximo de "{maxSize}"
th: ขนาดกลุ่มธุรกรรมเกินขนาดสูงสุดที่ "{maxSize}"
tr: İşlem grubu boyutu maksimum "{maxSize}" boyutunu aşıyor.
vi: Kích thước nhóm giao dịch vượt quá kích thước tối đa là "{maxSize}"

# searchPrompt
source: Enter an assetID, name, asset, or symbol ID (for ARC-200).
es: Ingresa un assetID, nombre, activo o ID de símbolo (para ARC-200).
th: ป้อน assetID, ชื่อ, สินทรัพย์ หรือสัญลักษณ์ ID (สำหรับ ARC-200)
tr: Bir assetID, isim, varlık veya sembol ID (ARC-200) girin.
vi: Nhập ID tài sản, tên, tài sản hoặc ID ký hiệu (cho ARC-200).

# searchQueryLabel
source: Search Query
es: Consulta de búsqueda
th: ค้นหา
tr: Arama Sorgusu
vi: Truy vấn Tìm kiếm

source: No assets found.
es: No se encontraron activos.
th: ไม่พบสินทรัพย์
tr: Hiçbir varlık bulunamadı.
vi: Không tìm thấy tài sản.

# genericErrorMessage
source: Sorry, there was an error.
es: Lo sentimos, ocurrió un error.
th: ขออภัย เกิดข้อผิดพลาด
tr: Üzgünüz, bir hata oluştu.
vi: Rất tiếc, đã xảy ra lỗi.

# notAvailable
source: N/A
es: No disponible
th: ไม่มีข้อมูล
tr: Yok

# contactsTab
source: Contacts
es: Contactos
th: ผู้ติดต่อ
tr: Kişiler
vi: Danh bạ

# myAccountsTab
source: My Accounts
es: Mis Cuentas
th: บัญชีของฉัน
tr: Hesaplarım
vi: Tài khoản của tôi

source: Cancel
es: Cancelar
th: ยกเลิก
tr: İptal
vi: Hủy

# deleteContactTitle
source: Delete Contact
es: Eliminar Contacto
th: ลบผู้ติดต่อ
tr: Kişiyi Sil
vi: Xóa liên hệ

# deleteContactMessage
source: Are you sure you want to delete {contactName}?
es: ¿Estás seguro de que deseas eliminar {contactName}?
th: คุณแน่ใจหรือไม่ว่าต้องการลบ {contactName}
tr: {contactName} adlı kişiyi silmek istediğinizden emin misiniz?
vi: Bạn có chắc chắn muốn xóa {contactName}?

# selectAccountTitle
source: Select Account
es: Seleccionar Cuenta
th: เลือกบัญชี
tr: Hesap Seçin
vi: Chọn tài khoản

# errorMessage
source: Error: {error}
th: ข้อผิดพลาด: {error}
tr: Hata: {error}
vi: Lỗi: {error}

source: No accounts found
es: No se encontraron cuentas
th: ไม่พบบัญชี
tr: Hiçbir hesap bulunamadı
vi: Không tìm thấy tài khoản

source: No Public Key
es: Sin Clave Pública
th: ไม่มีคีย์สาธารณะ
tr: Genel Anahtar Yok
vi: Không có khóa công khai

# assetsTab
source: Assets
es: Activos
th: สินทรัพย์
tr: Varlıklar
vi: Tài sản

# activityTab
source: Activity
es: Actividad
th: กิจกรรม
tr: Etkinlik
vi: Hoạt động

# selectNetworkHeader
source: Select Network
es: Seleccionar Red
th: เลือกเครือข่าย
tr: Ağ Seçin
vi: Chọn Mạng

# networkSwitchSuccess
source: Switched to {networkName}
es: Cambiado a {networkName}
th: เปลี่ยนไปใช้ {networkName} แล้ว
tr: {networkName} ağına geçildi
vi: Đã chuyển sang {networkName}

# networkSwitchFailure
source: Failed to switch to {networkName}
es: Fallo al cambiar a {networkName}
th: ไม่สามารถเปลี่ยนไปใช้ {networkName}
tr: {networkName} ağına geçiş başarısız oldu
vi: Không thể chuyển sang {networkName}

# minimumBalanceInfo
source: Minimum balance is {balance} VOI. Based on the account configuration, this is the minimum balance needed to keep the account open.
es: El saldo mínimo es {balance} VOI. Basado en la configuración de la cuenta, este es el saldo mínimo necesario para mantener la cuenta abierta.
th: ยอดคงเหลือขั้นต่ำคือ {balance} VOI ขึ้นอยู่กับการกำหนดค่าบัญชี นี่คือยอดคงเหลือขั้นต่ำที่จำเป็นในการเปิดบัญชี
tr: Minimum bakiye {balance} VOI'dir. Hesap yapılandırmasına göre, bu hesabı açık tutmak için gereken minimum bakiyedir.
vi: Số dư tối thiểu là {balance} VOI. Dựa trên cấu hình tài khoản, đây là số dư tối thiểu cần thiết để giữ tài khoản hoạt động.

# infoHeader
source: Info
es: Información
th: ข้อมูล
tr: Bilgi
vi: Thông tin

source: Loading Account
es: Cargando Cuenta
th: กำลังโหลดบัญชี
tr: Hesap Yükleniyor
vi: Đang tải tài khoản

source: Please wait
es: Por favor espera
th: กรุณารอ
tr: Lütfen bekleyin
vi: Vui lòng chờ

# genericError
source: Error
th: ข้อผิดพลาด
tr: Hata
vi: Lỗi

source: Error loading transactions
es: Error al cargar las transacciones
th: เกิดข้อผิดพลาดในการโหลดธุรกรรม
tr: İşlemler yüklenirken hata oluştu
vi: Lỗi tải giao dịch

# selectTransactionPrompt
source: Select a transaction to view details
es: Selecciona una transacción para ver detalles
th: เลือกธุรกรรมเพื่อดูรายละเอียด
tr: Detayları görüntülemek için bir işlem seçin
vi: Chọn một giao dịch để xem chi tiết

source: No Transactions Found
es: No se encontraron transacciones.
th: ไม่พบธุรกรรม
tr: Hiçbir İşlem Bulunamadı
vi: Không tìm thấy giao dịch nào

# noTransactionsMade
source: You have not made any transactions.
es: No has realizado ninguna transacción.
th: คุณยังไม่ได้ทำธุรกรรมใด ๆ
tr: Hiçbir işlem yapmadınız.
vi: Bạn chưa thực hiện giao dịch nào.

source: No more transactions.
es: No hay más transacciones.
th: ไม่มีธุรกรรมเพิ่มเติม
tr: Daha fazla işlem yok.
vi: Không còn giao dịch nào.

# noAssets
source: No Assets Found
es: No se encontraron activos.
th: ไม่พบสินทรัพย์
tr: Hiçbir Varlık Bulunamadı
vi: Không tìm thấy tài sản

# noAssetsForFilter
source: No Assets Found for the Filter
es: No se encontraron activos para el filtro
th: ไม่พบสินทรัพย์สำหรับตัวกรอง
tr: Filtre için hiçbir Varlık Bulunamadı
vi: Không tìm thấy tài sản cho bộ lọc

# tryClearingFilter
source: Try clearing the filter to see all assets.
es: Intenta borrar el filtro para ver todos los activos.
th: ลองล้างตัวกรองเพื่อดูสินทรัพย์ทั้งหมด
tr: Tüm varlıkları görmek için filtreyi temizlemeyi deneyin.
vi: Hãy thử xóa bộ lọc để xem tất cả tài sản.

# noAssetsAdded
source: You have not added any assets.
es: No has agregado ningún activo.
th: คุณยังไม่ได้เพิ่มสินทรัพย์ใด ๆ
tr: Hiçbir varlık eklenmedi.
vi: Bạn chưa thêm tài sản nào.

source: Clear Filter
es: Borrar Filtro
th: ล้างตัวกรอง
tr: Filtreyi Temizle
vi: Xóa bộ lọc

source: Retry
es: Reintentar
th: ลองอีกครั้ง
tr: Tekrar Dene
vi: Thử lại

source: Error loading assets
es: Error al cargar los activos
th: เกิดข้อผิดพลาดในการโหลดสินทรัพย์
tr: Varlıklar yüklenirken hata oluştu
vi: Lỗi tải tài sản

# sortAndFilter
source: Sort and Filter Assets
es: Ordenar y Filtrar Activos
th: เรียงลำดับและกรองสินทรัพย์
tr: Varlıkları Sırala ve Filtrele
vi: Sắp xếp và lọc tài sản

source: Show Frozen Assets
es: Mostrar Activos Congelados
th: แสดงสินทรัพย์ที่ถูกแช่แข็ง
tr: Dondurulmuş Varlıkları Göster
vi: Hiển thị tài sản bị đóng băng

source: Copy Address
es: Copiar Dirección
th: คัดลอกที่อยู่
tr: Adresi Kopyala
vi: Sao chép địa chỉ

source: Share Address
es: Compartir Dirección
th: แชร์ที่อยู่
tr: Adresi Paylaş
vi: Chia sẻ địa chỉ

# editAccount
source: Edit
es: Editar
th: แก้ไข
tr: Düzenle
vi: Chỉnh sửa

# refreshAccount
source: Refresh
es: Actualizar
th: รีเฟรช
tr: Yenile
vi: Làm mới

source: No Account Name
es: Sin Nombre de Cuenta
th: ไม่มีชื่อบัญชี
tr: Hesap Adı Yok
vi: Không có tên tài khoản

source: Options
es: Opciones
th: ตัวเลือก
tr: Seçenekler
vi: Tùy chọn

source: No NFTs Found
es: No se encontraron NFTs.
th: ไม่พบ NFTs
tr: Hiçbir NFT Bulunamadı
vi: Không tìm thấy NFT nào

# noNftsForFilter
source: No NFTs Found for the Filter
es: No se encontraron NFTs para el filtro
th: ไม่พบ NFTs สำหรับตัวกรอง
tr: Filtre için hiçbir NFT Bulunamadı
vi: Không tìm thấy NFT cho bộ lọc

# noNftsAdded
source: You have not added any NFTs.
es: No has agregado ningún NFT.
th: คุณยังไม่ได้เพิ่ม NFTs ใด ๆ
tr: Hiçbir NFT eklenmedi.
vi: Bạn chưa thêm NFT nào.

source: Filter
es: Filtrar
th: ตัวกรอง
tr: Filtre
vi: Lọc

source: Scan QR Code
es: Escanear Código QR
th: สแกนรหัส QR
tr: QR Kodunu Tara
vi: Quét mã QR

source: Share QR
es: Compartir QR
th: แชร์ QR
tr: QR'yi Paylaş
vi: Chia sẻ mã QR

source: Copy URI
es: Copiar URI
th: คัดลอก URI
tr: URI'yi Kopyala
vi: Sao chép URI

source: Download QR Image
es: Descargar Imagen QR
th: ดาวน์โหลดภาพ QR
tr: QR Resmini İndir
vi: Tải xuống hình ảnh mã QR

source: Close
es: Cerrar
th: ปิด
tr: Kapat
vi: Đóng

source: Transaction ID Copied
es: ID de Transacción Copiado
th: คัดลอก ID ธุรกรรมแล้ว
tr: İşlem Kimliği Kopyalandı
vi: ID giao dịch đã được sao chép

source: Payment
es: Pago
th: การชำระเงิน
tr: Ödeme
vi: Thanh toán

source: Asset Transfer
es: Transferencia de Activos
th: การโอนสินทรัพย์
tr: Varlık Transferi
vi: Chuyển tài sản

# errorTitle
source: Error
th: ข้อผิดพลาด
tr: Hata
vi: Lỗi

# defaultErrorMessage
source: There was an error. No further details provided.
es: Hubo un error. No se proporcionaron más detalles.
th: เกิดข้อผิดพลาด ไม่มีรายละเอียดเพิ่มเติม
tr: Bir hata oluştu. Daha fazla bilgi sağlanmadı.
vi: Đã xảy ra lỗi. Không có thông tin chi tiết nào khác.

source: Back
es: Atrás
th: กลับ
tr: Geri
vi: Quay lại

source: Create Pin
es: Crear PIN
th: สร้าง PIN
tr: Pin Oluştur
vi: Tạo mã PIN

source: Confirm Pin
es: Confirmar PIN
th: ยืนยัน PIN
tr: Pin Onayla
vi: Xác nhận mã PIN

source: Unlock
es: Desbloquear
th: ปลดล็อก
tr: Kilidi Aç
vi: Mở khóa

source: Verify Pin
es: Verificar PIN
th: ยืนยัน PIN
tr: Pin Doğrula
vi: Xác minh mã PIN

source: Resetting App
es: Restableciendo la Aplicación
th: กำลังรีเซ็ตแอป
tr: Uygulama Sıfırlanıyor
vi: Đang đặt lại ứng dụng

source: Invalid QR code data
es: Datos del código QR inválidos
th: ข้อมูลรหัส QR ไม่ถูกต้อง
tr: Geçersiz QR kodu verisi
vi: Dữ liệu mã QR không hợp lệ

# expectedPrivateKeyQr
source: Expected a private key QR code but found a public key.
es: Se esperaba un código QR de clave privada, pero se encontró una clave pública.
th: คาดหวังรหัส QR คีย์ส่วนตัวแต่พบคีย์สาธารณะ
tr: Özel anahtar QR kodu bekleniyordu, ancak genel anahtar bulundu.
vi: Dự kiến mã QR khóa riêng tư nhưng lại nhận được khóa công khai.

# expectedWalletConnectUri
source: Expected a private key QR code but found a WalletConnect URI.
es: Se esperaba un código QR de clave privada, pero se encontró un URI de WalletConnect.
th: คาดหวังรหัส QR คีย์ส่วนตัวแต่พบ WalletConnect URI
tr: Özel anahtar QR kodu bekleniyordu, ancak WalletConnect URI bulundu.
vi: Dự kiến mã QR khóa riêng tư nhưng lại nhận được URI WalletConnect.

# expectedPublicKeyQr
source: Expected a public key QR code but found something else.
es: Se esperaba un código QR de clave pública, pero se encontró otra cosa.
th: คาดหวังรหัส QR คีย์สาธารณะแต่พบอย่างอื่น
tr: Genel anahtar QR kodu bekleniyordu, ancak başka bir şey bulundu.
vi: Dự kiến mã QR khóa công khai nhưng lại nhận được loại khác.

# expectedWalletConnectSessionQr
source: Expected a WalletConnect session QR code but found something else.
es: Se esperaba un código QR de sesión de WalletConnect, pero se encontró otra cosa.
th: คาดหวังรหัส QR เซสชัน WalletConnect แต่พบอย่างอื่น
tr: WalletConnect oturum QR kodu bekleniyordu, ancak başka bir şey bulundu.
vi: Dự kiến mã QR phiên WalletConnect nhưng lại nhận được loại khác.

source: Unknown QR Code type
es: Tipo de Código QR desconocido
th: ประเภทของรหัส QR ไม่ทราบ
tr: Bilinmeyen QR Kodu türü
vi: Loại mã QR không xác định

# walletConnectV1NotSupported
source: WalletConnect V1 URIs are not supported.
es: Los URIs de WalletConnect V1 no son compatibles.
th: ไม่รองรับ WalletConnect V1 URIs
tr: WalletConnect V1 URI'leri desteklenmiyor.
vi: Không hỗ trợ URI WalletConnect V1.

# invalidWalletConnectUri
source: Invalid WalletConnect URI format.
es: Formato de URI de WalletConnect inválido.
th: รูปแบบ WalletConnect URI ไม่ถูกต้อง
tr: Geçersiz WalletConnect URI formatı.
vi: Định dạng URI WalletConnect không hợp lệ.

# failedToParseWalletConnectUri
source: Failed to parse WalletConnect URI: {error}
es: Error al analizar el URI de WalletConnect: {error}
th: ไม่สามารถแยกวิเคราะห์ WalletConnect URI: {error}
tr: WalletConnect URI çözümlenemedi: {error}
vi: Không thể phân tích URI WalletConnect: {error}

source: Unknown import account URI format
es: Formato de URI de importación de cuenta desconocido
th: รูปแบบ URI การนำเข้าบัญชีไม่ทราบ
tr: Bilinmeyen hesap URI formatı
vi: Định dạng URI nhập tài khoản không xác định

# paginatedUriMissingInfo
source: Paginated URI missing checksum or page information
es: URI paginado carece de información de checksum o página
th: URI แบบแบ่งหน้าขาดข้อมูล checksum หรือหน้า
tr: Parçalı URI eksik bilgi içeriyor
vi: URI phân trang thiếu thông tin checksum hoặc trang

# invalidPageFormatInUri
source: Invalid page format in paginated URI
es: Formato de página inválido en URI paginado
th: รูปแบบหน้าที่ไม่ถูกต้องใน URI แบบแบ่งหน้า
tr: Parçalı URI'deki sayfa formatı geçersiz
vi: Định dạng trang không hợp lệ trong URI phân trang

source: Invalid Public Key Format
es: Formato de Clave Pública Inválido
th: รูปแบบคีย์สาธารณะไม่ถูกต้อง
tr: Geçersiz Genel Anahtar Formatı
vi: Định dạng khóa công khai không hợp lệ

source: Invalid URI format
es: Formato de URI inválido
th: รูปแบบ URI ไม่ถูกต้อง
tr: Geçersiz URI formatı
vi: Định dạng URI không hợp lệ

source: Invalid private key
es: Clave privada inválida
th: คีย์ส่วนตัวไม่ถูกต้อง
tr: Geçersiz özel anahtar
vi: Khóa riêng tư không hợp lệ

source: Missing private key in legacy URI
es: Falta la clave privada en el URI heredado
th: ไม่มีคีย์ส่วนตัวใน URI แบบเก่า
tr: Eski URI'de özel anahtar eksik
vi: Thiếu khóa riêng tư trong URI kế thừa

# keyNeitherBase64NorHex
source: Key is neither valid Base64 nor valid Hex: {key}
es: La clave no es ni Base64 válida ni Hex válida: {key}
th: คีย์ไม่ใช่ Base64 หรือ Hex ที่ถูกต้อง: {key}
tr: Anahtar ne geçerli Base64 ne de geçerli Hex: {key}
vi: Khóa không phải Base64 hợp lệ cũng không phải Hex hợp lệ: {key}

# failedToDecodePrivateKey
source: Failed to decode private key: {error}
es: Error al decodificar la clave privada: {error}
th: ไม่สามารถถอดรหัสคีย์ส่วนตัว: {error}
tr: Özel anahtar çözümlenemedi: {error}
vi: Không thể giải mã khóa riêng tư: {error}

# unknownWalletConnectVersion
source: Unknown WalletConnect version. Unable to pair.
es: Versión desconocida de WalletConnect. No se puede emparejar.
th: ไม่ทราบเวอร์ชันของ WalletConnect ไม่สามารถจับคู่ได้
tr: Bilinmeyen WalletConnect sürümü. Eşleşme yapılamıyor.
vi: Phiên bản WalletConnect không xác định. Không thể ghép đôi.

source: Invalid private key length.
es: Longitud de clave privada inválida.
th: ความยาวคีย์ส่วนตัวไม่ถูกต้อง
tr: Geçersiz özel anahtar uzunluğu.
vi: Chiều dài khóa riêng tư không hợp lệ.

source: Imported Account
es: Cuenta Importada
th: บัญชีที่นำเข้า
tr: Aktarılan Hesap
vi: Tài khoản đã nhập

# importedAccountWithCounter
source: Imported Account {counter}
es: Cuenta Importada {counter}
th: บัญชีที่นำเข้า {counter}
tr: Aktarılan Hesap {counter}
vi: Tài khoản đã nhập {counter}

# connectToTitle
source: Connect to:
es: Conectar a:
th: เชื่อมต่อกับ:
tr: Bağlan:
vi: Kết nối với:

# failedFinalizeAccountImport
source: Failed to finalize account import.
es: Error al finalizar la importación de la cuenta.
th: การนำเข้าบัญชีล้มเหลว
tr: Hesap aktarımı tamamlanamadı.
vi: Không thể hoàn tất nhập tài khoản.

source: Error processing public key
es: Error al procesar la clave pública
th: ข้อผิดพลาดในการประมวลผลคีย์สาธารณะ
tr: Genel anahtar işlenirken hata
vi: Lỗi xử lý khóa công khai

source: Successfully connected
es: Conectado con éxito
th: เชื่อมต่อสำเร็จ
tr: Başarıyla bağlanıldı
vi: Đã kết nối thành công

# nextQrCode
source: Next QR:
es: Siguiente QR:
th: QR ถัดไป:
tr: Sonraki QR:
vi: Mã QR tiếp theo:

# partNumber
source: Part {partNumber}
es: Parte {partNumber}
th: ส่วนที่ {partNumber}
tr: Bölüm {partNumber}
vi: Phần {partNumber}

# expectedPrivateKeyButPublic
source: Expected a private key QR code but found a public key.
es: Se esperaba un código QR de clave privada, pero se encontró una clave pública.
th: คาดหวังรหัส QR คีย์ส่วนตัวแต่พบคีย์สาธารณะ
tr: Özel anahtar QR kodu bekleniyordu, ancak genel anahtar bulundu.
vi: Dự kiến mã QR khóa riêng tư nhưng lại nhận được khóa công khai.

# expectedPrivateKeyButWalletConnect
source: Expected a private key QR code but found a WalletConnect URI.
es: Se esperaba un código QR de clave privada, pero se encontró un URI de WalletConnect.
th: คาดหวังรหัส QR คีย์ส่วนตัวแต่พบ WalletConnect URI
tr: Özel anahtar QR kodu bekleniyordu, ancak WalletConnect URI bulundu.
vi: Dự kiến mã QR khóa riêng tư nhưng lại nhận được URI WalletConnect.

# expectedPublicKey
source: Expected a public key QR code but found something else.
es: Se esperaba un código QR de clave pública, pero se encontró otra cosa.
th: คาดหวังรหัส QR คีย์สาธารณะแต่พบอย่างอื่น
tr: Genel anahtar QR kodu bekleniyordu, ancak başka bir şey bulundu.
vi: Dự kiến mã QR khóa công khai nhưng lại nhận được loại khác.

# failedParseWalletConnectUri
source: Failed to parse WalletConnect URI
es: Error al analizar el URI de WalletConnect
th: ไม่สามารถแยกวิเคราะห์ WalletConnect URI
tr: WalletConnect URI çözümlenemedi
vi: Không thể phân tích URI WalletConnect

# invalidPageFormat
source: Invalid page format in paginated URI
es: Formato de página inválido en URI paginado
th: รูปแบบหน้าที่ไม่ถูกต้องใน URI แบบแบ่งหน้า
tr: Parçalı URI'deki sayfa formatı geçersiz
vi: Định dạng trang không hợp lệ trong URI phân trang

# missingPrivateKeyLegacy
source: Missing privatekey in legacy URI
es: Falta la clave privada en el URI heredado
th: ไม่มีคีย์ส่วนตัวใน URI แบบเก่า
tr: Eski URI'de özel anahtar eksik
vi: Thiếu khóa riêng tư trong URI kế thừa

# unknownImportUriFormat
source: Unknown import account URI format
es: Formato de URI de importación de cuenta desconocido
th: รูปแบบ URI การนำเข้าบัญชีไม่ทราบ
tr: Bilinmeyen hesap aktarım URI formatı
vi: Định dạng URI nhập tài khoản không xác định

# importAccountTitle
source: Import Account
es: Importar Cuenta
th: นำเข้าบัญชี
tr: Hesap Aktar
vi: Nhập tài khoản

# scanAddressTitle
source: Scan Address
es: Escanear Dirección
th: สแกนที่อยู่
tr: Adres Tara
vi: Quét địa chỉ

# connectTitle
source: Connect
es: Conectar
th: เชื่อมต่อ
tr: Bağlan
vi: Kết nối

# qrCodeScannerTitle
source: QR Code Scanner
es: Escáner de Código QR
th: เครื่องสแกนรหัส QR
tr: QR Kod Tarayıcı
vi: Máy quét mã QR

source: Processing QR Code
es: Procesando Código QR
th: กำลังประมวลผลรหัส QR
tr: QR Kodu İşleniyor
vi: Đang xử lý mã QR

source: Invalid scan result
es: Resultado de escaneo inválido
th: ผลการสแกนไม่ถูกต้อง
tr: Geçersiz tarama sonucu
vi: Kết quả quét không hợp lệ

source: No accounts available to connect.
es: No hay cuentas disponibles para conectar.
th: ไม่มีบัญชีที่สามารถเชื่อมต่อได้
tr: Bağlanacak hesap yok.
vi: Không có tài khoản nào khả dụng để kết nối.

source: Error loading accounts
es: Error al cargar las cuentas
th: เกิดข้อผิดพลาดในการโหลดบัญชี
tr: Hesaplar yüklenirken hata oluştu
vi: Lỗi tải tài khoản

source: Unnamed Asset
es: Activo Sin Nombre
th: สินทรัพย์ไม่มีชื่อ
tr: Adlandırılmamış Varlık
vi: Tài sản chưa đặt tên

source: No Network
es: Sin Red
th: ไม่มีเครือข่าย
tr: Ağ Yok
vi: Không có mạng

# pleaseEnterValidAmount
source: Please enter a valid amount
es: Por favor, introduce un monto válido
th: กรุณาป้อนจำนวนเงินที่ถูกต้อง
tr: Lütfen geçerli bir miktar girin
vi: Vui lòng nhập một số tiền hợp lệ

# pleaseEnterValidAlgorandAddress
source: Please enter a valid Algorand address
es: Por favor, introduce una dirección de Algorand válida
th: กรุณาป้อนที่อยู่ Algorand ที่ถูกต้อง
tr: Lütfen geçerli bir Algorand adresi girin
vi: Vui lòng nhập một địa chỉ Algorand hợp lệ

source: Insufficient funds
es: Fondos insuficientes
th: ยอดเงินคงเหลือไม่เพียงพอ
tr: Yetersiz bakiye
vi: Số dư không đủ

source: Transaction successful
es: Transacción exitosa
th: ทำธุรกรรมสำเร็จ
tr: İşlem başarılı
vi: Giao dịch thành công

source: No active account ID found
es: No se encontró ID de cuenta activa
th: ไม่พบ ID บัญชีที่ใช้งาน
tr: Aktif hesap kimliği bulunamadı
vi: Không tìm thấy ID tài khoản đang hoạt động

source: Private key not found in storage
es: Clave privada no encontrada en el almacenamiento
th: ไม่พบคีย์ส่วนตัวในที่จัดเก็บ
tr: Özel anahtar depoda bulunamadı
vi: Không tìm thấy khóa riêng tư trong bộ nhớ

# noItemSelectedForTransaction
source: No item selected for the transaction.
es: No se seleccionó ningún elemento para la transacción.
th: ไม่มีรายการที่เลือกสำหรับการทำธุรกรรม
tr: İşlem için hiçbir öğe seçilmedi.
vi: Không có mục nào được chọn cho giao dịch.

source: Standard Asset transfer successful.
es: Transferencia de Activo Estándar exitosa.
th: โอนสินทรัพย์มาตรฐานสำเร็จ
tr: Standart Varlık transferi başarılı.
vi: Chuyển tài sản tiêu chuẩn thành công.

source: ARC-0200 Asset transfer successful.
es: Transferencia de Activo ARC-0200 exitosa.
th: โอนสินทรัพย์ ARC-0200 สำเร็จ
tr: ARC-0200 Varlık transferi başarılı.
vi: Chuyển tài sản ARC-0200 thành công.

# unsupportedAssetType
source: Unsupported asset type: {assetType}
es: Tipo de activo no compatible: {assetType}
th: ไม่รองรับประเภทสินทรัพย์: {assetType}
tr: Desteklenmeyen varlık türü: {assetType}
vi: Loại tài sản không được hỗ trợ: {assetType}
