Repository: kibis-is/mobile-app
Catalog: lib/l10n/intl_*.arb
Languages: es, th, tr, vi

# accountNotFundedPleaseFundToSeeDetails
source: This account has not been funded yet. Please fund it to see details.
es: Esta cuenta no ha sido financiada aún. Por favor, financia la cuenta para ver detalles.
th: บัญชีนี้ยังไม่ได้รับเงิน โปรดเติมเงินเพื่อดูรายละเอียด
tr: Bu hesap henüz finanse edilmedi. Detayları görmek için lütfen fon sağlayın.
vi: Tài khoản này chưa được cấp tiền. Vui lòng cấp tiền để xem chi tiết.

source: Account name is too long.
es: El nombre de la cuenta es demasiado largo.
th: ชื่อบัญชียาวเกินไป
tr: Hesap adı çok uzun.
vi: Tên tài khoản quá dài.

# failedToCreateAccountName
source: Failed to create account name: {error}
es: Error al crear el nombre de la cuenta: {error}
th: ไม่สามารถสร้างชื่อบัญชีได้: {error}
tr: Hesap adı oluşturulamadı: {error}
vi: Không thể tạo tên tài khoản: {error}

# failedToCreateAccount
source: Failed to create account: {error}
es: Error al crear la cuenta: {error}
th: ไม่สามารถสร้างบัญชีได้: {error}
tr: Hesap oluşturulamadı: {error}
vi: Không thể tạo tài khoản: {error}

source: No active account to update.
es: No hay cuenta activa para actualizar.
th: ไม่มีบัญชีที่ใช้งานเพื่ออัปเดต
tr: Güncellenecek etkin hesap yok.
vi: Không có tài khoản đang hoạt động để cập nhật.

source: Account not found.
es: Cuenta no encontrada.
th: ไม่พบบัญชี
tr: Hesap bulunamadı.
vi: Không tìm thấy tài khoản.

# failedToDeleteAccount
source: Failed to delete account: {error}
es: Error al eliminar la cuenta: {error}
th: ไม่สามารถลบบัญชีได้: {error}
tr: Hesap silinemedi: {error}
vi: Không thể xóa tài khoản: {error}

# failedToRestoreAccount
source: Failed to restore account: {error}
es: Error al restaurar la cuenta: {error}
th: ไม่สามารถกู้คืนบัญชีได้: {error}
tr: Hesap geri yüklenemedi: {error}
vi: Không thể khôi phục tài khoản: {error}

source: No active account.
es: No hay cuenta activa.
th: ไม่มีบัญชีที่ใช้งาน
tr: Etkin hesap yok.
vi: Không có tài khoản đang hoạt động.

source: Seed phrase not found in storage.
es: Frase semilla no encontrada en el almacenamiento.
th: ไม่พบ Seed phrase ในที่เก็บข้อมูล
tr: Seed kelime grubu depolamada bulunamadı.
vi: Không tìm thấy cụm từ khóa trong bộ nhớ.

# publicAddressNotAvailable
source: Public address is not available.
es: Dirección pública no disponible.
th: ที่อยู่สาธารณะไม่พร้อมใช้งาน
tr: Genel adres mevcut değil.
vi: Địa chỉ công khai không khả dụng.

# accountMissingInTemporaryData
source: Account is missing in temporary account data.
es: Falta la cuenta en los datos temporales.
th: บัญชีหายไปจากข้อมูลบัญชีชั่วคราว
tr: Hesap, geçici hesap verilerinde eksik.
vi: Tài khoản bị thiếu trong dữ liệu tạm thời.

# incompleteTemporaryAccountData
source: Incomplete temporary account data for regular account.
es: Datos temporales de cuenta incompletos para cuenta regular.
th: ข้อมูลบัญชีชั่วคราวไม่สมบูรณ์สำหรับบัญชีปกติ
tr: Normal hesap için eksik geçici hesap verileri.
vi: Dữ liệu tài khoản tạm thời không đầy đủ cho tài khoản thông thường.

source: Public key is missing.
es: Falta la clave pública.
th: คีย์สาธารณะหายไป
tr: Genel anahtar eksik.
vi: Khóa công khai bị thiếu.

source: Unsupported account type.
es: Tipo de cuenta no soportado.
th: ประเภทบัญชีไม่รองรับ
tr: Desteklenmeyen hesap türü.
vi: Loại tài khoản không được hỗ trợ.

# failedToFinalizeAccountCreation
source: Failed to finalize account creation: {error}
es: Error al finalizar la creación de la cuenta: {error}
th: ไม่สามารถทำการสร้างบัญชีให้สมบูรณ์ได้: {error}
tr: Hesap oluşturma tamamlanamadı: {error}
vi: Không thể hoàn tất tạo tài khoản: {error}

# failedToCreateUnsignedTransactions
source: Failed to create unsigned transfer transactions: {error}
es: Error al crear transacciones de transferencia sin firmar: {error}
th: ไม่สามารถสร้างธุรกรรมที่ยังไม่ได้เซ็นได้: {error}
tr: İmzalanmamış transfer işlemleri oluşturulamadı: {error}
vi: Không thể tạo giao dịch chuyển khoản chưa ký: {error}

# transactionIdInvalid
source: Transaction failed: Transaction ID invalid or marked as 'error'.
es: Error en la transacción: ID de transacción inválido o marcado como 'error'.
th: การทำธุรกรรมล้มเหลว: รหัสธุรกรรมไม่ถูกต้องหรือถูกระบุว่า 'ผิดพลาด'
tr: İşlem başarısız: İşlem Kimliği geçersiz veya 'hata' olarak işaretlenmiş.
vi: Giao dịch thất bại: ID giao dịch không hợp lệ hoặc được đánh dấu là 'lỗi'.

# failedToSendPayment
source: Failed to send payment: {error}
es: Error al enviar el pago: {error}
th: ไม่สามารถส่งการชำระเงินได้: {error}
tr: Ödeme gönderilemedi: {error}
vi: Không thể gửi thanh toán: {error}

# getAccountAssetsFailed
source: Failed to fetch assets: {error}
es: Error al obtener los activos de la cuenta: {error}
th: ไม่สามารถดึงข้อมูลสินทรัพย์ในบัญชีได้: {error}
tr: Varlıklar alınamadı: {error}
vi: Không thể lấy danh sách tài sản: {error}

# assetDetailsFetchFailed
source: Failed to fetch asset details: {error}
es: Error al obtener los detalles del activo: {error}
th: ไม่สามารถดึงข้อมูลรายละเอียดสินทรัพย์ได้: {error}
tr: Varlık detayları alınamadı: {error}
vi: Không thể lấy thông tin chi tiết tài sản: {error}

# assetIdInvalidFormat
source: Invalid asset ID format. Asset ID must be a valid integer.
es: Formato de ID de activo inválido. El ID de activo debe ser un número entero válido.
th: รูปแบบรหัสสินทรัพย์ไม่ถูกต้อง รหัสสินทรัพย์ต้องเป็นจำนวนเต็มที่ถูกต้อง
tr: Geçersiz varlık kimliği formatı. Varlık kimliği geçerli bir tam sayı olmalıdır.
vi: Định dạng ID tài sản không hợp lệ. ID tài sản phải là một số nguyên hợp lệ.

# assetOptInFailed
source: Failed to opt-in to asset: {error}
es: Error al optar por el activo: {error}
th: ไม่สามารถลงทะเบียนสินทรัพย์ได้: {error}
tr: Varlık eklenemedi: {error}
vi: Không thể đăng ký tài sản: {error}

# arc200AssetFetchFailed
source: Failed to fetch ARC-0200 asset details
es: Error al obtener detalles del activo ARC-0200
th: ไม่สามารถดึงข้อมูลสินทรัพย์ ARC-0200 ได้
tr: ARC-0200 varlık detayları alınamadı.
vi: Không thể lấy thông tin chi tiết tài sản ARC-0200.

# failedToTransferAsset
source: Failed to transfer asset: {error}
es: Error al transferir el activo: {error}
th: ไม่สามารถโอนสินทรัพย์ได้: {error}
tr: Varlık transferi başarısız oldu: {error}
vi: Không thể chuyển tài sản: {error}

# failedToToggleFreeze
source: Failed to {action} asset: {error}
es: Error al {action} el activo: {error}
th: ไม่สามารถ {action} สินทรัพย์ได้: {error}
tr: Varlık {action} işlemi başarısız: {error}
vi: Không thể {action} tài sản: {error}

# failedToRevokeAsset
source: Failed to revoke asset: {error}
es: Error al revocar el activo: {error}
th: ไม่สามารถเพิกถอนสินทรัพย์ได้: {error}
tr: Varlık iptali başarısız: {error}
vi: Không thể thu hồi tài sản: {error}

# failedToFetchTransactions
source: Failed to fetch transactions: {error}
es: Error al obtener transacciones: {error}
th: ไม่สามารถดึงข้อมูลธุรกรรมได้: {error}
tr: İşlemler alınamadı: {error}
vi: Không thể lấy danh sách giao dịch: {error}

# contractOptInFailed
source: Failed to opt-in to contract: {error}
es: Error al optar por el contrato: {error}
th: ไม่สามารถลงทะเบียนสัญญาได้: {error}
tr: Sözleşme eklenemedi: {error}
vi: Không thể đăng ký hợp đồng: {error}

# contractCallFailed
source: Failed to call contract: {error}
es: Error al llamar al contrato: {error}
th: ไม่สามารถเรียกสัญญาได้: {error}
tr: Sözleşme çağrısı başarısız oldu: {error}
vi: Không thể gọi hợp đồng: {error}

# transactionError
source: Transaction error: {error}
es: Error en la transacción: {error}
th: ข้อผิดพลาดของธุรกรรม: {error}
tr: İşlem hatası: {error}
vi: Lỗi giao dịch: {error}

# searchQueryTooShort
source: Search query is too short.
es: La consulta de búsqueda es demasiado corta.
th: คำค้นหาสั้นเกินไป
tr: Arama sorgusu çok kısa.
vi: Truy vấn tìm kiếm quá ngắn.

# failedToFetchAssets
source: Failed to fetch assets: {error}
es: Error al obtener activos: {error}
th: ไม่สามารถดึงข้อมูลสินทรัพย์ได้: {error}
tr: Varlıklar alınamadı: {error}
vi: Không thể lấy danh sách tài sản: {error}

# failedToGetAccountBalance
source: Failed to get account balance: {error}
es: Error al obtener el saldo de la cuenta: {error}
th: ไม่สามารถดึงยอดคงเหลือของบัญชีได้: {error}
tr: Hesap bakiyesi alınamadı: {error}
vi: Không thể lấy số dư tài khoản: {error}

source: Asset edit confirmation failed.
es: Error en la confirmación de edición del activo.
th: การยืนยันการแก้ไขสินทรัพย์ล้มเหลว
tr: Varlık düzenleme onayı başarısız oldu.
vi: Xác nhận chỉnh sửa tài sản thất bại.

# failedToEditAsset
source: Failed to edit asset: {error}
es: Error al editar el activo: {error}
th: ไม่สามารถแก้ไขสินทรัพย์ได้: {error}
tr: Varlık düzenlenemedi: {error}
vi: Không thể chỉnh sửa tài sản: {error}

# failedToDestroyAsset
source: Failed to destroy asset: {error}
es: Error al destruir el activo: {error}
th: ไม่สามารถทำลายสินทรัพย์ได้: {error}
tr: Varlık silinemedi: {error}
vi: Không thể hủy tài sản: {error}

source: Asset destruction confirmation failed.
es: Error en la confirmación de destrucción del activo.
th: การยืนยันการทำลายสินทรัพย์ล้มเหลว
tr: Varlık silme onayı başarısız oldu.
vi: Xác nhận hủy tài sản thất bại.

# failedToOptInAsset
source: Failed to opt-in to asset.
es: Error al optar por el activo.
th: ไม่สามารถลงทะเบียนสินทรัพย์ได้
tr: Varlık eklenemedi.
vi: Không thể đăng ký tài sản.

# privateKeyNotFound
source: Private key not found for the active account.
es: Clave privada no encontrada para la cuenta activa.
th: ไม่พบคีย์ส่วนตัวสำหรับบัญชีที่ใช้งาน
tr: Etkin hesap için özel anahtar bulunamadı.
vi: Không tìm thấy khóa riêng tư cho tài khoản đang hoạt động.

source: Asset opt-in confirmation failed.
es: Error en la confirmación de adhesión al activo.
th: การยืนยันการลงทะเบียนสินทรัพย์ล้มเหลว
tr: Varlık ekleme onayı başarısız oldu.
vi: Xác nhận đăng ký tài sản thất bại.

# failedToOptInToASA
source: Failed to opt-in to ASA: {error}
es: Error al optar por el ASA: {error}
th: ไม่สามารถลงทะเบียน ASA ได้: {error}
tr: ASA varlığı eklenemedi: {error}
vi: Không thể đăng ký tài sản ASA: {error}

# assetNameOrUnitMissing
source: Asset name or unit name is missing.
es: Falta el nombre del activo o el nombre de la unidad.
th: ชื่อสินทรัพย์หรือชื่อหน่วยหายไป
tr: Varlık adı veya birim adı eksik.
vi: Thiếu tên tài sản hoặc đơn vị tài sản.

# failedToFollowArc200Asset
source: Failed to follow ARC-0200 asset.
es: Error al seguir el activo ARC-0200.
th: ไม่สามารถติดตามสินทรัพย์ ARC-0200 ได้
tr: ARC-0200 varlığı takibe alınamadı.
vi: Không thể theo dõi tài sản ARC-0200.

source: Asset transfer confirmation failed.
es: Error en la confirmación de transferencia del activo.
th: การยืนยันการโอนสินทรัพย์ล้มเหลว
tr: Varlık transfer onayı başarısız oldu.
vi: Xác nhận chuyển tài sản thất bại.

source: Asset is frozen.
es: El activo está congelado.
th: สินทรัพย์ถูกแช่แข็ง
tr: Varlık dondurulmuş.
vi: Tài sản đã bị đóng băng.

# privateKeyNotFoundForAccount
source: Private key not found for account ID: {accountId}
es: Clave privada no encontrada para el ID de cuenta: {accountId}
th: ไม่พบคีย์ส่วนตัวสำหรับบัญชี ID: {accountId}
tr: Hesap kimliği için özel anahtar bulunamadı: {accountId}
vi: Không tìm thấy khóa riêng tư cho tài khoản ID: {accountId}

# invalidEncodedKeyLength
source: The encoded key should be 44 characters long.
es: La clave codificada debe tener 44 caracteres.
th: คีย์ที่เข้ารหัสควรมีความยาว 44 อักขระ
tr: Kodlanmış anahtar 44 karakter uzunluğunda olmalıdır.
vi: Chuỗi khóa mã hóa phải dài 44 ký tự.

source: Contact not found.
es: Contacto no encontrado.
th: ไม่พบผู้ติดต่อ
tr: Kişi bulunamadı.
vi: Không tìm thấy liên hệ.

source: Almost there
es: Casi llegamos
th: เกือบถึงแล้ว
tr: Neredeyse bitti
vi: Sắp xong rồi

source: Hang in there
es: Aguanta un poco más
th: รอก่อนนะ
tr: Biraz daha sabredin
vi: Hãy kiên nhẫn

source: Just a bit more
es: Solo un poco más
th: อีกนิดเดียว
tr: Biraz daha kaldı
vi: Chỉ còn một chút nữa

source: You're doing great
es: Lo estás haciendo genial
th: คุณกำลังทำได้ดี
tr: Harika gidiyorsunuz
vi: Bạn đang làm rất tốt

source: Nearly done
es: Casi terminado
th: เกือบเสร็จแล้ว
tr: Neredeyse tamam
vi: Sắp xong

source: Thanks for waiting
es: Gracias por esperar
th: ขอบคุณที่รอ
tr: Beklediğiniz için teşekkürler
vi: Cảm ơn bạn đã chờ đợi

# checksumMismatch
source: Checksum does not match. The scanned QR codes are not from the same set.
es: El checksum no coincide. Los códigos QR escaneados no son del mismo conjunto.
th: ค่า checksum ไม่ตรงกัน โค้ด QR ที่สแกนไม่ใช่ชุดเดียวกัน
tr: Checksum uyuşmuyor. Taratılan QR kodları aynı setten değil.
vi: Mã kiểm tra không khớp. Các mã QR được quét không thuộc cùng một tập.

# networkChangedTo
source: Network changed to {networkName}
es: Red cambiada a {networkName}
th: เครือข่ายเปลี่ยนเป็น {networkName}
tr: Ağa geçildi: {networkName}
vi: Mạng đã được chuyển sang {networkName}

# failedToLoadNFTs
source: Failed to load NFTs with status code: {statusCode}
es: Error al cargar NFTs con el código de estado: {statusCode}
th: ไม่สามารถโหลด NFTs ได้ รหัสสถานะ: {statusCode}
tr: NFT'ler yüklenemedi. Durum kodu: {statusCode}
vi: Không thể tải NFTs với mã trạng thái: {statusCode}

source: Setting Up
es: Configurando
th: กำลังตั้งค่า
tr: Kurulum Yapılıyor
vi: Đang thiết lập

source: Authenticating
es: Autenticando
th: กำลังยืนยันตัวตน
tr: Kimlik doğrulanıyor
vi: Đang xác thực

source: Verifying
es: Verificando
th: กำลังตรวจสอบ
tr: Doğrulanıyor
vi: Đang xác minh

source: Setting New PIN
es: Estableciendo un nuevo PIN
th: กำลังตั้งรหัส PIN ใหม่
tr: Yeni PIN Ayarlanıyor
vi: Đang thiết lập mã PIN mới

# accountNameNotFound
source: Account name not found for activeAccountId: {activeAccountId}
es: Nombre de cuenta no encontrado para activeAccountId: {activeAccountId}
th: ไม่พบชื่อบัญชีสำหรับ activeAccountId: {activeAccountId}
tr: Etkin hesap kimliği için hesap adı bulunamadı: {activeAccountId}
vi: Không tìm thấy tên tài khoản cho activeAccountId: {activeAccountId}

source: Incorrect PIN
es: PIN incorrecto
th: รหัส PIN ไม่ถูกต้อง
tr: Hatalı PIN
vi: Mã PIN không chính xác

source: Invalid PIN. Try again.
es: PIN inválido. Intenta de nuevo.
th: รหัส PIN ไม่ถูกต้อง โปรดลองอีกครั้ง
tr: Geçersiz PIN. Tekrar deneyin.
vi: Mã PIN không hợp lệ. Vui lòng thử lại.

# failedToSetPin
source: Failed to set PIN: {error}
es: Error al establecer el PIN: {error}
th: ไม่สามารถตั้งค่ารหัส PIN ได้: {error}
tr: PIN ayarlanamadı: {error}
vi: Không thể thiết lập mã PIN: {error}

source: Error reading pin hash.
es: Error al leer el hash del PIN.
th: เกิดข้อผิดพลาดในการอ่านค่า pin hash
tr: PIN hash okunurken hata oluştu.
vi: Lỗi khi đọc mã băm của mã PIN.

# failedToReadAccountsData
source: Failed to read accounts data: {error}
es: Error al leer los datos de las cuentas: {error}
th: ไม่สามารถอ่านข้อมูลบัญชีได้: {error}
tr: Hesap verileri okunamadı: {error}
vi: Không thể đọc dữ liệu tài khoản: {error}

# sharedPreferencesNotInitialized
source: SharedPreferences is not initialized.
es: SharedPreferences no está inicializado.
th: SharedPreferences ยังไม่ได้รับการเริ่มต้น
tr: SharedPreferences başlatılmadı.
vi: SharedPreferences chưa được khởi tạo.

source: Failed to save sessions.
es: Error al guardar las sesiones.
th: ไม่สามารถบันทึกเซสชันได้
tr: Oturumlar kaydedilemedi.
vi: Không thể lưu các phiên.

source: Failed to retrieve sessions.
es: Error al recuperar las sesiones.
th: ไม่สามารถดึงข้อมูลเซสชันได้
tr: Oturumlar getirilemedi.
vi: Không thể lấy các phiên.

source: Failed to remove sessions.
es: Error al eliminar las sesiones.
th: ไม่สามารถลบเซสชันได้
tr: Oturumlar kaldırılamadı.
vi: Không thể xóa các phiên.

# failedToCreateWatchAccount
source: Failed to create watch account: {error}
es: Error al crear la cuenta de observación: {error}
th: ไม่สามารถสร้างบัญชี Watch ได้: {error}
tr: Takip hesabı oluşturulamadı: {error}
vi: Không thể tạo tài khoản giám sát: {error}

source: Account already added.
es: Cuenta ya añadida.
th: บัญชีนี้ถูกเพิ่มแล้ว
tr: Hesap zaten eklenmiş.
vi: Tài khoản đã được thêm.

# seedPhraseNotAvailable
source: Seed phrase is not available.
es: Frase semilla no disponible.
th: Seed phrase ไม่พร้อมใช้งาน
tr: Seed phrase mevcut değil.
vi: Cụm từ khóa không khả dụng.

source: Something went wrong.
es: Algo salió mal.
th: มีบางอย่างผิดพลาด
tr: Bir şeyler ters gitti.
vi: Đã xảy ra lỗi.

# accountNameNotFoundForId
source: Account name not found for accountId: {accountId}
es: Nombre de cuenta no encontrado para accountId: {accountId}
th: ไม่พบชื่อบัญชีสำหรับ accountId: {accountId}
tr: Hesap adı bulunamadı: {accountId}
vi: Không tìm thấy tên tài khoản cho accountId: {accountId}

# failedToSelectAccount
source: Failed to select account: {error}
es: Error al seleccionar la cuenta: {error}
th: ไม่สามารถเลือกบัญชีได้: {error}
tr: Hesap seçilemedi: {error}
vi: Không thể chọn tài khoản: {error}

# failedToCompleteAccountSetup
source: Failed to complete account setup: {error}
es: Error al completar la configuración de la cuenta: {error}
th: ไม่สามารถตั้งค่าบัญชีให้สมบูรณ์ได้: {error}
tr: Hesap kurulumu tamamlanamadı: {error}
vi: Không thể hoàn tất thiết lập tài khoản: {error}

# invalidIconType
source: Icon must be either IconData or a String path to SVG.
es: El icono debe ser IconData o una ruta de archivo SVG.
th: ไอคอนต้องเป็น IconData หรือเส้นทางไปยัง SVG
tr: Simge ya IconData ya da SVG yolu olmalıdır.
vi: Biểu tượng phải là IconData hoặc đường dẫn String tới SVG.

# resetAppFailed
source: Reset app failed: {error}
es: Error al reiniciar la aplicación: {error}
th: การรีเซ็ตแอปล้มเหลว: {error}
tr: Uygulama sıfırlanamadı: {error}
vi: Đặt lại ứng dụng thất bại: {error}

# failedToDisconnectWalletConnectSessions
source: Failed to disconnect WalletConnect sessions: {error}
es: Error al desconectar sesiones WalletConnect: {error}
th: ไม่สามารถตัดการเชื่อมต่อ WalletConnect เซสชันได้: {error}
tr: WalletConnect oturumları sonlandırılamadı: {error}
vi: Không thể ngắt kết nối các phiên WalletConnect: {error}

# failedToClearStorage
source: Failed to clear storage: {error}
es: Error al borrar el almacenamiento: {error}
th: ไม่สามารถล้างที่เก็บข้อมูลได้: {error}
tr: Depolama temizlenemedi: {error}
vi: Không thể xóa bộ nhớ: {error}

source: Failed to load ARC200 balances.
es: Error al cargar los saldos ARC-0200.
th: ไม่สามารถโหลดยอดคงเหลือ ARC-0200 ได้
tr: ARC200 bakiyeleri yüklenemedi.
vi: Không thể tải số dư ARC-0200.

# noArc200TokenDetailsForNetwork
source: No ARC200 token details available for the selected network.
es: No hay detalles de tokens ARC-0200 disponibles para la red seleccionada.
th: ไม่มีรายละเอียดโทเค็น ARC-0200 สำหรับเครือข่ายที่เลือก
tr: Seçilen ağ için ARC200 token bilgileri mevcut değil.
vi: Không có thông tin chi tiết token ARC-0200 cho mạng đã chọn.

source: Failed to load ARC200 token details.
es: Error al cargar los detalles del token ARC-0200.
th: ไม่สามารถโหลดรายละเอียดโทเค็น ARC-0200 ได้
tr: ARC200 token detayları yüklenemedi.
vi: Không thể tải thông tin chi tiết token ARC-0200.

# tokenDetailsNotFound
source: Token details not found for contractId {contractId}.
es: No se encontraron detalles del token para el contrato {contractId}.
th: ไม่พบรายละเอียดโทเค็นสำหรับ contractId {contractId}
tr: Token detayları bulunamadı: {contractId}
vi: Không tìm thấy thông tin chi tiết token cho contractId {contractId}.

source: Failed to search ARC200 assets.
es: Error al buscar activos ARC-0200.
th: ไม่สามารถค้นหาสินทรัพย์ ARC-0200 ได้
tr: ARC200 varlıkları aranamadı.
vi: Không thể tìm kiếm tài sản ARC-0200.

# networkNotConfiguredForArc200
source: Network not configured for ARC200 operations.
es: La red no está configurada para operaciones ARC-0200.
th: เครือข่ายไม่ได้รับการกำหนดค่าสำหรับการทำงาน ARC-0200
tr: Seçilen ağ ARC200 işlemleri için yapılandırılmamış.
vi: Mạng chưa được cấu hình cho các thao tác ARC-0200.

# failedToFetchArc200Balance
source: Failed to fetch ARC200 balance for contract {contractId}.
es: Error al obtener el saldo ARC-0200 para el contrato {contractId}.
th: ไม่สามารถดึงยอดคงเหลือ ARC-0200 สำหรับสัญญา {contractId} ได้
tr: ARC200 bakiyesi alınamadı: {contractId}
vi: Không thể lấy số dư ARC-0200 cho hợp đồng {contractId}.

# assetNotFoundForContract
source: Asset not found for contract {contractId}.
es: Activo no encontrado para el contrato {contractId}.
th: ไม่พบสินทรัพย์สำหรับสัญญา {contractId}
tr: Bu sözleşme için varlık bulunamadı: {contractId}
vi: Không tìm thấy tài sản cho hợp đồng {contractId}.

source: Copied to clipboard
es: Copiado al portapapeles
th: คัดลอกไปยังคลิปบอร์ดแล้ว
tr: Panoya kopyalandı
vi: Đã sao chép vào clipboard

# unsupportedEncodingOrInvalidFormat
source: Unsupported encoding or invalid string format.
es: Codificación no soportada o formato de cadena inválido.
th: การเข้ารหัสไม่รองรับหรือรูปแบบสตริงไม่ถูกต้อง
tr: Desteklenmeyen kodlama veya geçersiz dize formatı.
vi: Mã hóa không được hỗ trợ hoặc định dạng chuỗi không hợp lệ.

# privateKeyMissingInUri
source: Private key is missing in the URI.
es: Falta la clave privada en la URI.
th: คีย์ส่วนตัวหายไปใน URI
tr: URI içinde özel anahtar eksik.
vi: Khóa riêng tư bị thiếu trong URI.

# unsupportedEncodingInUri
source: Unsupported encoding in the URI.
es: Codificación no soportada en la URI.
th: การเข้ารหัสที่ไม่รองรับใน URI
tr: URI içinde desteklenmeyen kodlama.
vi: Mã hóa không được hỗ trợ trong URI.

source: Invalid hex string length.
es: Longitud de cadena hexadecimal inválida.
th: ความยาวสตริงเลขฐานสิบหกไม่ถูกต้อง
tr: Geçersiz hex dize uzunluğu.
vi: Độ dài chuỗi hex không hợp lệ.

source: Invalid Base64 string.
es: Cadena Base64 inválida.
th: สตริง Base64 ไม่ถูกต้อง
tr: Geçersiz Base64 dizesi.
vi: Chuỗi Base64 không hợp lệ.

source: Invalid Base32 string.
es: Cadena Base32 inválida.
th: สตริง Base32 ไม่ถูกต้อง
tr: Geçersiz Base32 dizesi.
vi: Chuỗi Base32 không hợp lệ.

source: Here is my QR Code!
es: ¡Aquí está mi código QR!
th: นี่คือโค้ด QR ของฉัน
tr: İşte QR Kodum!
vi: Đây là mã QR của tôi!

source: Failed to approve session.
es: Error al aprobar la sesión.
th: ไม่สามารถอนุมัติเซสชันได้
tr: Oturum onaylanamadı.
vi: Không thể chấp thuận phiên.

source: Failed to disconnect session.
es: Error al desconectar la sesión.
th: ไม่สามารถตัดการเชื่อมต่อเซสชันได้
tr: Oturum sonlandırılamadı.
vi: Không thể ngắt kết nối phiên.

source: Language
es: Idioma
th: ภาษา
tr: Dil
vi: Ngôn ngữ

source: View Seed Phrase
es: Ver Frase Semilla
th: ดูวลีสำรอง
vi: Xem Cụm Từ Khóa

# nftsTab
source: NFTs
tr: NFT'ler
